# IOpenFromCloudCallback Methods

---
The IOpenFromCloudCallback type exposes the following members.
| Name| Description
---|---|---
| OnOpenConflict|  A method called when the conflict is happen during the model opening.
Top
#### Reference
IOpenFromCloudCallback Interface
Autodesk.Revit.DB Namespace